data_generation/simulation_results/of/case_11/constant/simParams
nIter 2000;
hComponent0 614.3357423297098;
hComponent1 1454.1833363239323;
hComponent2 807.8505932705051;
hComponent3 1286.3500159504426;
hComponent4 745.5407743404039;kComponent0 46.14493889360983;
kComponent1 83.9515163359275;
kComponent2 54.73475141517129;
kComponent3 49.20132839258009;
kComponent4 38.89848224664945;
tAmbient 300;
Ux 1.389810691154238;
kPCB 0.8726320239090608;